# Installation Directory
cask_args appdir: '/Applications'

# Browsers
cask 'firefox'
cask 'google-chrome'

# File Management
brew 'csvkit'
brew 'fzf'
brew 'helix'
brew 'jq'
brew 'sq'
brew 'zoxide'

# General Utilities
brew 'atuin'
brew 'lazygit'
brew 'node'
brew 'pnpm'
brew 'task'
brew 'taskwarrior-tui'

# Miscellaneous
brew 'fish'
brew 'frotz'

# Casks - Applications
cask '1password'
cask 'wezterm'
cask 'jetbrains-toolbox'
cask 'raycast'
cask 'sketch'

# Casks - Fonts
cask 'font-jetbrains-mono'

# Applications (via Mac App Store)
brew 'mas'
mas 'Tailscale', id: 1475387142
